MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32JG12B500F1024IL125/mcu.h
/** @} End of group EFM32JG12B500F1024IL125_Core */

/***************************************************************************//**
 * @defgroup EFM32JG12B500F1024IL125_Part Part
 * @{
 ******************************************************************************/

/** Part family */
#define _EFM32_JADE_FAMILY                      1  /**< JADE Gecko MCU Family  */
#define _EFM_DEVICE                                /**< Silicon Labs EFM-type microcontroller */
#define _SILICON_LABS_32B_SERIES_1                 /**< Silicon Labs series number */
#define _SILICON_LABS_32B_SERIES                1  /**< Silicon Labs series number */
#define _SILICON_LABS_32B_SERIES_1_CONFIG_2        /**< Series 1, Configuration 2 */
#define _SILICON_LABS_32B_SERIES_1_CONFIG       2  /**< Series 1, Configuration 2 */
#define _SILICON_LABS_GECKO_INTERNAL_SDID       84 /**< Silicon Labs internal use only, may change any time */
#define _SILICON_LABS_GECKO_INTERNAL_SDID_84       /**< Silicon Labs internal use only, may change any time */
#define _SILICON_LABS_32B_PLATFORM_2               /**< @deprecated Silicon Labs platform name */
#define _SILICON_LABS_32B_PLATFORM              2  /**< @deprecated Silicon Labs platform name */
#define _SILICON_LABS_32B_PLATFORM_2_GEN_2         /**< @deprecated Platform 2, generation 2 */
#define _SILICON_LABS_32B_PLATFORM_2_GEN        2  /**< @deprecated Platform 2, generation 2 */

/* If part number is not defined as compiler option, define it */
#if !defined(EFM32JG12B500F1024IL125)
#define EFM32JG12B500F1024IL125    1 /**< JADE Gecko Part */
#endif

/** Configure part number */
#define PART_NUMBER                "EFM32JG12B500F1024IL125" /**< Part Number */

/** Memory Base addresses and limits */
#define CRYPTO1_BITCLR_MEM_BASE    (0x440F0400UL)          /**< CRYPTO1_BITCLR base address  */
#define CRYPTO1_BITCLR_MEM_SIZE    (0x400UL)               /**< CRYPTO1_BITCLR available address space  */
#define CRYPTO1_BITCLR_MEM_END     (0x440F07FFUL)          /**< CRYPTO1_BITCLR end address  */
#define CRYPTO1_BITCLR_MEM_BITS    (0x0000000AUL)          /**< CRYPTO1_BITCLR used bits  */
#define RAM1_MEM_BASE              (0x20020000UL)          /**< RAM1 base address  */
#define RAM1_MEM_SIZE              (0x20000UL)             /**< RAM1 available address space  */
#define RAM1_MEM_END               (0x2003FFFFUL)          /**< RAM1 end address  */
#define RAM1_MEM_BITS              (0x00000011UL)          /**< RAM1 used bits  */
#define RAM2_MEM_BASE              (0x20040000UL)          /**< RAM2 base address  */
#define RAM2_MEM_SIZE              (0x800UL)               /**< RAM2 available address space  */
#define RAM2_MEM_END               (0x200407FFUL)          /**< RAM2 end address  */
#define RAM2_MEM_BITS              (0x0000000BUL)          /**< RAM2 used bits  */
#define CRYPTO0_BITCLR_MEM_BASE    (0x440F0000UL)          /**< CRYPTO0_BITCLR base address  */
#define CRYPTO0_BITCLR_MEM_SIZE    (0x400UL)               /**< CRYPTO0_BITCLR available address space  */
#define CRYPTO0_BITCLR_MEM_END     (0x440F03FFUL)          /**< CRYPTO0_BITCLR end address  */
#define CRYPTO0_BITCLR_MEM_BITS    (0x0000000AUL)          /**< CRYPTO0_BITCLR used bits  */
#define CRYPTO_BITCLR_MEM_BASE     CRYPTO0_BITCLR_MEM_BASE /**< Alias for CRYPTO0_BITCLR_MEM_BASE */
#define CRYPTO_BITCLR_MEM_SIZE     CRYPTO0_BITCLR_MEM_SIZE /**< Alias for CRYPTO0_BITCLR_MEM_SIZE */
#define CRYPTO_BITCLR_MEM_END      CRYPTO0_BITCLR_MEM_END  /**< Alias for CRYPTO0_BITCLR_MEM_END  */
#define CRYPTO_BITCLR_MEM_BITS     CRYPTO0_BITCLR_MEM_BITS /**< Alias for CRYPTO0_BITCLR_MEM_BITS */
#define CRYPTO1_MEM_BASE           (0x400F0400UL)          /**< CRYPTO1 base address  */
#define CRYPTO1_MEM_SIZE           (0x400UL)               /**< CRYPTO1 available address space  */
#define CRYPTO1_MEM_END            (0x400F07FFUL)          /**< CRYPTO1 end address  */
#define CRYPTO1_MEM_BITS           (0x0000000AUL)          /**< CRYPTO1 used bits  */
#define CRYPTO0_BITSET_MEM_BASE    (0x460F0000UL)          /**< CRYPTO0_BITSET base address  */
#define CRYPTO0_BITSET_MEM_SIZE    (0x400UL)               /**< CRYPTO0_BITSET available address space  */
#define CRYPTO0_BITSET_MEM_END     (0x460F03FFUL)          /**< CRYPTO0_BITSET end address  */
#define CRYPTO0_BITSET_MEM_BITS    (0x0000000AUL)          /**< CRYPTO0_BITSET used bits  */
#define CRYPTO_BITSET_MEM_BASE     CRYPTO0_BITSET_MEM_BASE /**< Alias for CRYPTO0_BITSET_MEM_BASE */
#define CRYPTO_BITSET_MEM_SIZE     CRYPTO0_BITSET_MEM_SIZE /**< Alias for CRYPTO0_BITSET_MEM_SIZE */
#define CRYPTO_BITSET_MEM_END      CRYPTO0_BITSET_MEM_END  /**< Alias for CRYPTO0_BITSET_MEM_END  */
#define CRYPTO_BITSET_MEM_BITS     CRYPTO0_BITSET_MEM_BITS /**< Alias for CRYPTO0_BITSET_MEM_BITS */
#define RAM1_CODE_MEM_BASE         (0x10020000UL)          /**< RAM1_CODE base address  */
#define RAM1_CODE_MEM_SIZE         (0x20000UL)             /**< RAM1_CODE available address space  */
#define RAM1_CODE_MEM_END          (0x1003FFFFUL)          /**< RAM1_CODE end address  */
#define RAM1_CODE_MEM_BITS         (0x00000011UL)          /**< RAM1_CODE used bits  */
#define RAM0_CODE_MEM_BASE         (0x10000000UL)          /**< RAM0_CODE base address  */
#define RAM0_CODE_MEM_SIZE         (0x20000UL)             /**< RAM0_CODE available address space  */
#define RAM0_CODE_MEM_END          (0x1001FFFFUL)          /**< RAM0_CODE end address  */
#define RAM0_CODE_MEM_BITS         (0x00000011UL)          /**< RAM0_CODE used bits  */
#define FLASH_MEM_BASE             (0x00000000UL)          /**< FLASH base address  */
#define FLASH_MEM_SIZE             (0x10000000UL)          /**< FLASH available address space  */
#define FLASH_MEM_END              (0x0FFFFFFFUL)          /**< FLASH end address  */
#define FLASH_MEM_BITS             (0x0000001CUL)          /**< FLASH used bits  */
#define CRYPTO1_BITSET_MEM_BASE    (0x460F0400UL)          /**< CRYPTO1_BITSET base address  */
#define CRYPTO1_BITSET_MEM_SIZE    (0x400UL)               /**< CRYPTO1_BITSET available address space  */
#define CRYPTO1_BITSET_MEM_END     (0x460F07FFUL)          /**< CRYPTO1_BITSET end address  */
#define CRYPTO1_BITSET_MEM_BITS    (0x0000000AUL)          /**< CRYPTO1_BITSET used bits  */
#define RAM_MEM_BASE               (0x20000000UL)          /**< RAM base address  */
#define RAM_MEM_SIZE               (0x20000UL)             /**< RAM available address space  */
#define RAM_MEM_END                (0x2001FFFFUL)          /**< RAM end address  */
#define RAM_MEM_BITS               (0x00000011UL)          /**< RAM used bits  */
#define CRYPTO0_MEM_BASE           (0x400F0000UL)          /**< CRYPTO0 base address  */
#define CRYPTO0_MEM_SIZE           (0x400UL)               /**< CRYPTO0 available address space  */
#define CRYPTO0_MEM_END            (0x400F03FFUL)          /**< CRYPTO0 end address  */
#define CRYPTO0_MEM_BITS           (0x0000000AUL)          /**< CRYPTO0 used bits  */
#define CRYPTO_MEM_BASE            CRYPTO0_MEM_BASE        /**< Alias for CRYPTO0_MEM_BASE */
#define CRYPTO_MEM_SIZE            CRYPTO0_MEM_SIZE        /**< Alias for CRYPTO0_MEM_SIZE */
#define CRYPTO_MEM_END             CRYPTO0_MEM_END         /**< Alias for CRYPTO0_MEM_END  */
#define CRYPTO_MEM_BITS            CRYPTO0_MEM_BITS        /**< Alias for CRYPTO0_MEM_BITS */
#define PER_BITSET_MEM_BASE        (0x46000000UL)          /**< PER_BITSET base address  */
#define PER_BITSET_MEM_SIZE        (0xF0000UL)             /**< PER_BITSET available address space  */
#define PER_BITSET_MEM_END         (0x460EFFFFUL)          /**< PER_BITSET end address  */
#define PER_BITSET_MEM_BITS        (0x00000014UL)          /**< PER_BITSET used bits  */
#define PER_MEM_BASE               (0x40000000UL)          /**< PER base address  */
#define PER_MEM_SIZE               (0xF0000UL)             /**< PER available address space  */
#define PER_MEM_END                (0x400EFFFFUL)          /**< PER end address  */
#define PER_MEM_BITS               (0x00000014UL)          /**< PER used bits  */
#define RAM2_CODE_MEM_BASE         (0x10040000UL)          /**< RAM2_CODE base address  */
#define RAM2_CODE_MEM_SIZE         (0x800UL)               /**< RAM2_CODE available address space  */
#define RAM2_CODE_MEM_END          (0x100407FFUL)          /**< RAM2_CODE end address  */
#define RAM2_CODE_MEM_BITS         (0x0000000BUL)          /**< RAM2_CODE used bits  */
#define PER_BITCLR_MEM_BASE        (0x44000000UL)          /**< PER_BITCLR base address  */
#define PER_BITCLR_MEM_SIZE        (0xF0000UL)             /**< PER_BITCLR available address space  */
#define PER_BITCLR_MEM_END         (0x440EFFFFUL)          /**< PER_BITCLR end address  */
#define PER_BITCLR_MEM_BITS        (0x00000014UL)          /**< PER_BITCLR used bits  */

/** Bit banding area */
#define BITBAND_PER_BASE           (0x42000000UL) /**< Peripheral Address Space bit-band area */
#define BITBAND_RAM_BASE           (0x22000000UL) /**< SRAM Address Space bit-band area */

